updated architecture.md
